"""
Дан файл in.txt. В нём строки, длина не более 100. Надо переписать его в файл out.txt так, что:
1. В него не попали столбцы из #
2. После каждой строки добавить кол-во латинских символов в этой строке
3. Число латинских символов должно быть "выравнено" точками так, чтобы находилось в одном столбце. Минимум одна точка.
Весь файл читать нельзя. Сначала пишем КОД НА ЛИСТОЧКЕ, потом переписываем на комп

Пояснение:
in.txt
1###b
 #a#c
я#

out.txt
1##b.1
 a#c.2
я....0
"""

import string

matrix = ["1###b", ".#a#c", "я#..."]
counter = 0
for i in range(len(matrix)):
    for char in list(matrix[i]):
        if char in string.ascii_letters:
            counter += 1
            print(counter)
    matrix[i] + f".{counter}"
    counter = 0

print(matrix)
