"""
Пысларь Никита, ИУ7-11Б
Лабораторная работа #2, часть 2, з.3
Написать программу, которая по введенным значениям координат точки (x,y) определит, принадлежит ли точка заданной области, включая границы
"""

import math

# Ввод координат точки
x = float(input("Введите значение x: "))
y = float(input("Введите значение y: "))

in_area = False

# Решение
if y >= 0:
    # Левое верхнее крыло
    if -9 <= x < -8:
        if 7 * (x + 8) ** 2 + 1 <= y <= -1 / 8 * (x + 9) ** 2 + 8:
            in_area = True
    elif -8 <= x < -1:
        if 1 / 49 * (x + 1) ** 2 <= y <= -1 / 8 * (x + 9) ** 2 + 8:
            in_area = True

    # Правое верхнее крыло
    elif 1 <= x <= 8:
        if 1 / 49 * (x - 1) ** 2 <= y <= -1 / 8 * (x - 9) ** 2 + 8:
            in_area = True
    elif 8 < x <= 9:
        if 7 * (x - 8) ** 2 + 1 <= y <= -1 / 8 * (x - 9) ** 2 + 8:
            in_area = True
else:
    # Левое нижнее крыло
    if -8 <= x <= -2:
        if 1 / 3 * (x + 5) ** 2 - 7 <= y <= -1 / 16 * x**2:
            in_area = True
    elif -2 < x < -1:
        if -2 * (x + 1) ** 2 - 2 <= y <= -1 / 16 * x**2:
            in_area = True
    elif x == -1 and -2 <= y <= 0:
        in_area = True

    # Правое нижнее крыло
    elif x == 1 and -2 <= y <= 0:
        in_area = True
    elif 1 <= x <= 2:
        if -2 * (x - 1) ** 2 - 2 <= y <= -1 / 16 * x**2:
            in_area = True
    elif 2 < x <= 8:
        if 1 / 3 * (x - 5) ** 2 - 7 <= y <= -1 / 16 * x**2:
            in_area = True

# Усы бабочки
if -2 <= x <= 0:
    if -3 / 2 * x + 2 == y:
        in_area = True
elif 0 < x <= 2:
    if 3 / 2 * x + 2 == y:
        in_area = True

# Тело бабочки
if -1 <= x <= 1:
    if 4 * x**2 - 6 <= y <= -4 * x**2 + 2:
        in_area = True

# Вывод результата
if in_area:
    print("Точка принадлежит области")
else:
    print("Точка не принадлежит области")
